### Question 1 - SQL Aggregation & Filtering
You have a table transactions:

transaction_id | user_id | product_id | purchase_date | amount

Write a SQL query to return the top 5 users who spent the most in 2024. The output should include:

user_id | total_spent | number_of_purchases

Constraints:
- Only include purchases where amount > 0
- Only consider transactions where purchase_date is in 2024
- Sort by total_spent descending

In [1]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("example.db")

In [3]:
query = """
    SELECT user_id, SUM(amount) as total_spent, COUNT(*) as purchase_count
    FROM transactions
    WHERE amount > 150
    AND purchase_date >= '2023-01-01'
    GROUP BY user_id
    ORDER BY total_spent DESC
    LIMIT 5;
"""

df = pd.read_sql(query, conn)
df

  user_id  total_spent  purchase_count
0    Phil          400               1
1    Jack          300               1
2   Alice          250               1